LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
/*
 * Copyright 2021 MindMotion Microelectronics Co., Ltd.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __MM32F3273G_FEATURES_H__
#define __MM32F3273G_FEATURES_H__

#include "mm32f3273g.h"

/*!
 * @brief TIM_ADV_Type.
 */
#define TIM_ADV_Type TIM1_Type /*!< TIM ADV Module Register set referring to TIM1. */

/*!
 * @brief TIM_16B_Type.
 */
#define TIM_16B_Type TIM3_Type /*!< TIM 16B Module Register set referring to TIM3. */

/*!
 * @brief TIM_32B_Type.
 */
#define TIM_32B_Type TIM2_Type /*!< TIM 32B Module Register set referring to TIM2. */

/*!
 * @brief TIM_BASIC_Type.
 */
#define TIM_BASIC_Type TIM6_Type /*!< TIM BASIC Module Register set referring to TIM6. */

/*******************************************************************************
 * TIM_ADV Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_ADV_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_ADV_CR1 Register Bit Definition
 */

#define TIM_ADV_CR1_CKD_SHIFT                      TIM1_CR1_CKD_SHIFT
#define TIM_ADV_CR1_CKD_MASK                       TIM1_CR1_CKD_MASK
#define TIM_ADV_CR1_CKD(x)                         TIM1_CR1_CKD(x)

#define TIM_ADV_CR1_ARPE_SHIFT                     TIM1_CR1_ARPE_SHIFT
#define TIM_ADV_CR1_ARPE_MASK                      TIM1_CR1_ARPE_MASK
#define TIM_ADV_CR1_ARPE(x)                        TIM1_CR1_ARPE(x)

#define TIM_ADV_CR1_CMS_SHIFT                      TIM1_CR1_CMS_SHIFT
#define TIM_ADV_CR1_CMS_MASK                       TIM1_CR1_CMS_MASK
#define TIM_ADV_CR1_CMS(x)                         TIM1_CR1_CMS(x)

#define TIM_ADV_CR1_DIR_SHIFT                      TIM1_CR1_DIR_SHIFT
#define TIM_ADV_CR1_DIR_MASK                       TIM1_CR1_DIR_MASK
#define TIM_ADV_CR1_DIR(x)                         TIM1_CR1_DIR(x)

#define TIM_ADV_CR1_OPM_SHIFT                      TIM1_CR1_OPM_SHIFT
#define TIM_ADV_CR1_OPM_MASK                       TIM1_CR1_OPM_MASK
#define TIM_ADV_CR1_OPM(x)                         TIM1_CR1_OPM(x)

#define TIM_ADV_CR1_URS_SHIFT                      TIM1_CR1_URS_SHIFT
#define TIM_ADV_CR1_URS_MASK                       TIM1_CR1_URS_MASK
#define TIM_ADV_CR1_URS(x)                         TIM1_CR1_URS(x)

#define TIM_ADV_CR1_UDIS_SHIFT                     TIM1_CR1_UDIS_SHIFT
#define TIM_ADV_CR1_UDIS_MASK                      TIM1_CR1_UDIS_MASK
#define TIM_ADV_CR1_UDIS(x)                        TIM1_CR1_UDIS(x)

#define TIM_ADV_CR1_CEN_SHIFT                      TIM1_CR1_CEN_SHIFT
#define TIM_ADV_CR1_CEN_MASK                       TIM1_CR1_CEN_MASK
#define TIM_ADV_CR1_CEN(x)                         TIM1_CR1_CEN(x)

/*!
 * @brief TIM_ADV_CR2 Register Bit Definition
 */

#define TIM_ADV_CR2_OIS4_SHIFT                     TIM1_CR2_OIS4_SHIFT
#define TIM_ADV_CR2_OIS4_MASK                      TIM1_CR2_OIS4_MASK
#define TIM_ADV_CR2_OIS4(x)                        TIM1_CR2_OIS4(x)

#define TIM_ADV_CR2_OIS3N_SHIFT                    TIM1_CR2_OIS3N_SHIFT
#define TIM_ADV_CR2_OIS3N_MASK                     TIM1_CR2_OIS3N_MASK
#define TIM_ADV_CR2_OIS3N(x)                       TIM1_CR2_OIS3N(x)

#define TIM_ADV_CR2_OIS3_SHIFT                     TIM1_CR2_OIS3_SHIFT
#define TIM_ADV_CR2_OIS3_MASK                      TIM1_CR2_OIS3_MASK
#define TIM_ADV_CR2_OIS3(x)                        TIM1_CR2_OIS3(x)

#define TIM_ADV_CR2_OIS2N_SHIFT                    TIM1_CR2_OIS2N_SHIFT
#define TIM_ADV_CR2_OIS2N_MASK                     TIM1_CR2_OIS2N_MASK
#define TIM_ADV_CR2_OIS2N(x)                       TIM1_CR2_OIS2N(x)

#define TIM_ADV_CR2_OIS2_SHIFT                     TIM1_CR2_OIS2_SHIFT
#define TIM_ADV_CR2_OIS2_MASK                      TIM1_CR2_OIS2_MASK
#define TIM_ADV_CR2_OIS2(x)                        TIM1_CR2_OIS2(x)

#define TIM_ADV_CR2_OIS1N_SHIFT                    TIM1_CR2_OIS1N_SHIFT
#define TIM_ADV_CR2_OIS1N_MASK                     TIM1_CR2_OIS1N_MASK
#define TIM_ADV_CR2_OIS1N(x)                       TIM1_CR2_OIS1N(x)

#define TIM_ADV_CR2_OIS1_SHIFT                     TIM1_CR2_OIS1_SHIFT
#define TIM_ADV_CR2_OIS1_MASK                      TIM1_CR2_OIS1_MASK
#define TIM_ADV_CR2_OIS1(x)                        TIM1_CR2_OIS1(x)

#define TIM_ADV_CR2_TI1S_SHIFT                     TIM1_CR2_TI1S_SHIFT
#define TIM_ADV_CR2_TI1S_MASK                      TIM1_CR2_TI1S_MASK
#define TIM_ADV_CR2_TI1S(x)                        TIM1_CR2_TI1S(x)

#define TIM_ADV_CR2_MMS_SHIFT                      TIM1_CR2_MMS_SHIFT
#define TIM_ADV_CR2_MMS_MASK                       TIM1_CR2_MMS_MASK
#define TIM_ADV_CR2_MMS(x)                         TIM1_CR2_MMS(x)

#define TIM_ADV_CR2_CCDS_SHIFT                     TIM1_CR2_CCDS_SHIFT
#define TIM_ADV_CR2_CCDS_MASK                      TIM1_CR2_CCDS_MASK
#define TIM_ADV_CR2_CCDS(x)                        TIM1_CR2_CCDS(x)

#define TIM_ADV_CR2_CCUS_SHIFT                     TIM1_CR2_CCUS_SHIFT
#define TIM_ADV_CR2_CCUS_MASK                      TIM1_CR2_CCUS_MASK
#define TIM_ADV_CR2_CCUS(x)                        TIM1_CR2_CCUS(x)

#define TIM_ADV_CR2_CCPC_SHIFT                     TIM1_CR2_CCPC_SHIFT
#define TIM_ADV_CR2_CCPC_MASK                      TIM1_CR2_CCPC_MASK
#define TIM_ADV_CR2_CCPC(x)                        TIM1_CR2_CCPC(x)

/*!
 * @brief TIM_ADV_SMCR Register Bit Definition
 */

#define TIM_ADV_SMCR_ETP_SHIFT                     TIM1_SMCR_ETP_SHIFT
#define TIM_ADV_SMCR_ETP_MASK                      TIM1_SMCR_ETP_MASK
#define TIM_ADV_SMCR_ETP(x)                        TIM1_SMCR_ETP(x)

#define TIM_ADV_SMCR_ECE_SHIFT                     TIM1_SMCR_ECE_SHIFT
#define TIM_ADV_SMCR_ECE_MASK                      TIM1_SMCR_ECE_MASK
#define TIM_ADV_SMCR_ECE(x)                        TIM1_SMCR_ECE(x)

#define TIM_ADV_SMCR_ETPS_SHIFT                    TIM1_SMCR_ETPS_SHIFT
#define TIM_ADV_SMCR_ETPS_MASK                     TIM1_SMCR_ETPS_MASK
#define TIM_ADV_SMCR_ETPS(x)                       TIM1_SMCR_ETPS(x)

#define TIM_ADV_SMCR_ETF_SHIFT                     TIM1_SMCR_ETF_SHIFT
#define TIM_ADV_SMCR_ETF_MASK                      TIM1_SMCR_ETF_MASK
#define TIM_ADV_SMCR_ETF(x)                        TIM1_SMCR_ETF(x)

#define TIM_ADV_SMCR_MSM_SHIFT                     TIM1_SMCR_MSM_SHIFT
#define TIM_ADV_SMCR_MSM_MASK                      TIM1_SMCR_MSM_MASK
#define TIM_ADV_SMCR_MSM(x)                        TIM1_SMCR_MSM(x)

#define TIM_ADV_SMCR_TS_SHIFT                      TIM1_SMCR_TS_SHIFT
#define TIM_ADV_SMCR_TS_MASK                       TIM1_SMCR_TS_MASK
#define TIM_ADV_SMCR_TS(x)                         TIM1_SMCR_TS(x)

#define TIM_ADV_SMCR_OCCS_SHIFT                    TIM1_SMCR_OCCS_SHIFT
#define TIM_ADV_SMCR_OCCS_MASK                     TIM1_SMCR_OCCS_MASK
#define TIM_ADV_SMCR_OCCS(x)                       TIM1_SMCR_OCCS(x)

