LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_ADV_SMCR_SMS_SHIFT                     TIM1_SMCR_SMS_SHIFT
#define TIM_ADV_SMCR_SMS_MASK                      TIM1_SMCR_SMS_MASK
#define TIM_ADV_SMCR_SMS(x)                        TIM1_SMCR_SMS(x)

/*!
 * @brief TIM_ADV_DIER Register Bit Definition
 */

#define TIM_ADV_DIER_CC5DE_SHIFT                   TIM1_DIER_CC5DE_SHIFT
#define TIM_ADV_DIER_CC5DE_MASK                    TIM1_DIER_CC5DE_MASK
#define TIM_ADV_DIER_CC5DE(x)                      TIM1_DIER_CC5DE(x)

#define TIM_ADV_DIER_CC5IE_SHIFT                   TIM1_DIER_CC5IE_SHIFT
#define TIM_ADV_DIER_CC5IE_MASK                    TIM1_DIER_CC5IE_MASK
#define TIM_ADV_DIER_CC5IE(x)                      TIM1_DIER_CC5IE(x)

#define TIM_ADV_DIER_TDE_SHIFT                     TIM1_DIER_TDE_SHIFT
#define TIM_ADV_DIER_TDE_MASK                      TIM1_DIER_TDE_MASK
#define TIM_ADV_DIER_TDE(x)                        TIM1_DIER_TDE(x)

#define TIM_ADV_DIER_COMDE_SHIFT                   TIM1_DIER_COMDE_SHIFT
#define TIM_ADV_DIER_COMDE_MASK                    TIM1_DIER_COMDE_MASK
#define TIM_ADV_DIER_COMDE(x)                      TIM1_DIER_COMDE(x)

#define TIM_ADV_DIER_CC4DE_SHIFT                   TIM1_DIER_CC4DE_SHIFT
#define TIM_ADV_DIER_CC4DE_MASK                    TIM1_DIER_CC4DE_MASK
#define TIM_ADV_DIER_CC4DE(x)                      TIM1_DIER_CC4DE(x)

#define TIM_ADV_DIER_CC3DE_SHIFT                   TIM1_DIER_CC3DE_SHIFT
#define TIM_ADV_DIER_CC3DE_MASK                    TIM1_DIER_CC3DE_MASK
#define TIM_ADV_DIER_CC3DE(x)                      TIM1_DIER_CC3DE(x)

#define TIM_ADV_DIER_CC2DE_SHIFT                   TIM1_DIER_CC2DE_SHIFT
#define TIM_ADV_DIER_CC2DE_MASK                    TIM1_DIER_CC2DE_MASK
#define TIM_ADV_DIER_CC2DE(x)                      TIM1_DIER_CC2DE(x)

#define TIM_ADV_DIER_CC1DE_SHIFT                   TIM1_DIER_CC1DE_SHIFT
#define TIM_ADV_DIER_CC1DE_MASK                    TIM1_DIER_CC1DE_MASK
#define TIM_ADV_DIER_CC1DE(x)                      TIM1_DIER_CC1DE(x)

#define TIM_ADV_DIER_UDE_SHIFT                     TIM1_DIER_UDE_SHIFT
#define TIM_ADV_DIER_UDE_MASK                      TIM1_DIER_UDE_MASK
#define TIM_ADV_DIER_UDE(x)                        TIM1_DIER_UDE(x)

#define TIM_ADV_DIER_BIE_SHIFT                     TIM1_DIER_BIE_SHIFT
#define TIM_ADV_DIER_BIE_MASK                      TIM1_DIER_BIE_MASK
#define TIM_ADV_DIER_BIE(x)                        TIM1_DIER_BIE(x)

#define TIM_ADV_DIER_TIE_SHIFT                     TIM1_DIER_TIE_SHIFT
#define TIM_ADV_DIER_TIE_MASK                      TIM1_DIER_TIE_MASK
#define TIM_ADV_DIER_TIE(x)                        TIM1_DIER_TIE(x)

#define TIM_ADV_DIER_COMIE_SHIFT                   TIM1_DIER_COMIE_SHIFT
#define TIM_ADV_DIER_COMIE_MASK                    TIM1_DIER_COMIE_MASK
#define TIM_ADV_DIER_COMIE(x)                      TIM1_DIER_COMIE(x)

#define TIM_ADV_DIER_CC4IE_SHIFT                   TIM1_DIER_CC4IE_SHIFT
#define TIM_ADV_DIER_CC4IE_MASK                    TIM1_DIER_CC4IE_MASK
#define TIM_ADV_DIER_CC4IE(x)                      TIM1_DIER_CC4IE(x)

#define TIM_ADV_DIER_CC3IE_SHIFT                   TIM1_DIER_CC3IE_SHIFT
#define TIM_ADV_DIER_CC3IE_MASK                    TIM1_DIER_CC3IE_MASK
#define TIM_ADV_DIER_CC3IE(x)                      TIM1_DIER_CC3IE(x)

#define TIM_ADV_DIER_CC2IE_SHIFT                   TIM1_DIER_CC2IE_SHIFT
#define TIM_ADV_DIER_CC2IE_MASK                    TIM1_DIER_CC2IE_MASK
#define TIM_ADV_DIER_CC2IE(x)                      TIM1_DIER_CC2IE(x)

#define TIM_ADV_DIER_CC1IE_SHIFT                   TIM1_DIER_CC1IE_SHIFT
#define TIM_ADV_DIER_CC1IE_MASK                    TIM1_DIER_CC1IE_MASK
#define TIM_ADV_DIER_CC1IE(x)                      TIM1_DIER_CC1IE(x)

#define TIM_ADV_DIER_UIE_SHIFT                     TIM1_DIER_UIE_SHIFT
#define TIM_ADV_DIER_UIE_MASK                      TIM1_DIER_UIE_MASK
#define TIM_ADV_DIER_UIE(x)                        TIM1_DIER_UIE(x)

/*!
 * @brief TIM_ADV_SR Register Bit Definition
 */

#define TIM_ADV_SR_CC5IF_SHIFT                     TIM1_SR_CC5IF_SHIFT
#define TIM_ADV_SR_CC5IF_MASK                      TIM1_SR_CC5IF_MASK
#define TIM_ADV_SR_CC5IF(x)                        TIM1_SR_CC5IF(x)

#define TIM_ADV_SR_CC4OF_SHIFT                     TIM1_SR_CC4OF_SHIFT
#define TIM_ADV_SR_CC4OF_MASK                      TIM1_SR_CC4OF_MASK
#define TIM_ADV_SR_CC4OF(x)                        TIM1_SR_CC4OF(x)

#define TIM_ADV_SR_CC3OF_SHIFT                     TIM1_SR_CC3OF_SHIFT
#define TIM_ADV_SR_CC3OF_MASK                      TIM1_SR_CC3OF_MASK
#define TIM_ADV_SR_CC3OF(x)                        TIM1_SR_CC3OF(x)

#define TIM_ADV_SR_CC2OF_SHIFT                     TIM1_SR_CC2OF_SHIFT
#define TIM_ADV_SR_CC2OF_MASK                      TIM1_SR_CC2OF_MASK
#define TIM_ADV_SR_CC2OF(x)                        TIM1_SR_CC2OF(x)

#define TIM_ADV_SR_CC1OF_SHIFT                     TIM1_SR_CC1OF_SHIFT
#define TIM_ADV_SR_CC1OF_MASK                      TIM1_SR_CC1OF_MASK
#define TIM_ADV_SR_CC1OF(x)                        TIM1_SR_CC1OF(x)

#define TIM_ADV_SR_BIF_SHIFT                       TIM1_SR_BIF_SHIFT
#define TIM_ADV_SR_BIF_MASK                        TIM1_SR_BIF_MASK
#define TIM_ADV_SR_BIF(x)                          TIM1_SR_BIF(x)

#define TIM_ADV_SR_TIF_SHIFT                       TIM1_SR_TIF_SHIFT
#define TIM_ADV_SR_TIF_MASK                        TIM1_SR_TIF_MASK
#define TIM_ADV_SR_TIF(x)                          TIM1_SR_TIF(x)

#define TIM_ADV_SR_COMIF_SHIFT                     TIM1_SR_COMIF_SHIFT
#define TIM_ADV_SR_COMIF_MASK                      TIM1_SR_COMIF_MASK
#define TIM_ADV_SR_COMIF(x)                        TIM1_SR_COMIF(x)

#define TIM_ADV_SR_CC4IF_SHIFT                     TIM1_SR_CC4IF_SHIFT
#define TIM_ADV_SR_CC4IF_MASK                      TIM1_SR_CC4IF_MASK
#define TIM_ADV_SR_CC4IF(x)                        TIM1_SR_CC4IF(x)

#define TIM_ADV_SR_CC3IF_SHIFT                     TIM1_SR_CC3IF_SHIFT
#define TIM_ADV_SR_CC3IF_MASK                      TIM1_SR_CC3IF_MASK
#define TIM_ADV_SR_CC3IF(x)                        TIM1_SR_CC3IF(x)

#define TIM_ADV_SR_CC2IF_SHIFT                     TIM1_SR_CC2IF_SHIFT
#define TIM_ADV_SR_CC2IF_MASK                      TIM1_SR_CC2IF_MASK
#define TIM_ADV_SR_CC2IF(x)                        TIM1_SR_CC2IF(x)

#define TIM_ADV_SR_CC1IF_SHIFT                     TIM1_SR_CC1IF_SHIFT
#define TIM_ADV_SR_CC1IF_MASK                      TIM1_SR_CC1IF_MASK
#define TIM_ADV_SR_CC1IF(x)                        TIM1_SR_CC1IF(x)

#define TIM_ADV_SR_UIF_SHIFT                       TIM1_SR_UIF_SHIFT
#define TIM_ADV_SR_UIF_MASK                        TIM1_SR_UIF_MASK
#define TIM_ADV_SR_UIF(x)                          TIM1_SR_UIF(x)

/*!
 * @brief TIM_ADV_EGR Register Bit Definition
 */

