LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_ADV_RCR_REPCNT_SHIFT                   TIM1_RCR_REPCNT_SHIFT
#define TIM_ADV_RCR_REPCNT_MASK                    TIM1_RCR_REPCNT_MASK
#define TIM_ADV_RCR_REPCNT(x)                      TIM1_RCR_REPCNT(x)

#define TIM_ADV_RCR_REP_SHIFT                      TIM1_RCR_REP_SHIFT
#define TIM_ADV_RCR_REP_MASK                       TIM1_RCR_REP_MASK
#define TIM_ADV_RCR_REP(x)                         TIM1_RCR_REP(x)

/*!
 * @brief TIM_ADV_CCR1 Register Bit Definition
 */

#define TIM_ADV_CCR1_CCR1_SHIFT                    TIM1_CCR1_CCR1_SHIFT
#define TIM_ADV_CCR1_CCR1_MASK                     TIM1_CCR1_CCR1_MASK
#define TIM_ADV_CCR1_CCR1(x)                       TIM1_CCR1_CCR1(x)

/*!
 * @brief TIM_ADV_CCR2 Register Bit Definition
 */

#define TIM_ADV_CCR2_CCR2_SHIFT                    TIM1_CCR2_CCR2_SHIFT
#define TIM_ADV_CCR2_CCR2_MASK                     TIM1_CCR2_CCR2_MASK
#define TIM_ADV_CCR2_CCR2(x)                       TIM1_CCR2_CCR2(x)

/*!
 * @brief TIM_ADV_CCR3 Register Bit Definition
 */

#define TIM_ADV_CCR3_CCR3_SHIFT                    TIM1_CCR3_CCR3_SHIFT
#define TIM_ADV_CCR3_CCR3_MASK                     TIM1_CCR3_CCR3_MASK
#define TIM_ADV_CCR3_CCR3(x)                       TIM1_CCR3_CCR3(x)

/*!
 * @brief TIM_ADV_CCR4 Register Bit Definition
 */

#define TIM_ADV_CCR4_CCR4_SHIFT                    TIM1_CCR4_CCR4_SHIFT
#define TIM_ADV_CCR4_CCR4_MASK                     TIM1_CCR4_CCR4_MASK
#define TIM_ADV_CCR4_CCR4(x)                       TIM1_CCR4_CCR4(x)

/*!
 * @brief TIM_ADV_BDTR Register Bit Definition
 */

#define TIM_ADV_BDTR_DOE_SHIFT                     TIM1_BDTR_DOE_SHIFT
#define TIM_ADV_BDTR_DOE_MASK                      TIM1_BDTR_DOE_MASK
#define TIM_ADV_BDTR_DOE(x)                        TIM1_BDTR_DOE(x)

#define TIM_ADV_BDTR_MOE_SHIFT                     TIM1_BDTR_MOE_SHIFT
#define TIM_ADV_BDTR_MOE_MASK                      TIM1_BDTR_MOE_MASK
#define TIM_ADV_BDTR_MOE(x)                        TIM1_BDTR_MOE(x)

#define TIM_ADV_BDTR_AOE_SHIFT                     TIM1_BDTR_AOE_SHIFT
#define TIM_ADV_BDTR_AOE_MASK                      TIM1_BDTR_AOE_MASK
#define TIM_ADV_BDTR_AOE(x)                        TIM1_BDTR_AOE(x)

#define TIM_ADV_BDTR_BKP_SHIFT                     TIM1_BDTR_BKP_SHIFT
#define TIM_ADV_BDTR_BKP_MASK                      TIM1_BDTR_BKP_MASK
#define TIM_ADV_BDTR_BKP(x)                        TIM1_BDTR_BKP(x)

#define TIM_ADV_BDTR_BKE_SHIFT                     TIM1_BDTR_BKE_SHIFT
#define TIM_ADV_BDTR_BKE_MASK                      TIM1_BDTR_BKE_MASK
#define TIM_ADV_BDTR_BKE(x)                        TIM1_BDTR_BKE(x)

#define TIM_ADV_BDTR_OSSR_SHIFT                    TIM1_BDTR_OSSR_SHIFT
#define TIM_ADV_BDTR_OSSR_MASK                     TIM1_BDTR_OSSR_MASK
#define TIM_ADV_BDTR_OSSR(x)                       TIM1_BDTR_OSSR(x)

#define TIM_ADV_BDTR_OSSI_SHIFT                    TIM1_BDTR_OSSI_SHIFT
#define TIM_ADV_BDTR_OSSI_MASK                     TIM1_BDTR_OSSI_MASK
#define TIM_ADV_BDTR_OSSI(x)                       TIM1_BDTR_OSSI(x)

#define TIM_ADV_BDTR_LOCK_SHIFT                    TIM1_BDTR_LOCK_SHIFT
#define TIM_ADV_BDTR_LOCK_MASK                     TIM1_BDTR_LOCK_MASK
#define TIM_ADV_BDTR_LOCK(x)                       TIM1_BDTR_LOCK(x)

#define TIM_ADV_BDTR_DTG_SHIFT                     TIM1_BDTR_DTG_SHIFT
#define TIM_ADV_BDTR_DTG_MASK                      TIM1_BDTR_DTG_MASK
#define TIM_ADV_BDTR_DTG(x)                        TIM1_BDTR_DTG(x)

/*!
 * @brief TIM_ADV_DCR Register Bit Definition
 */

#define TIM_ADV_DCR_DBL_SHIFT                      TIM1_DCR_DBL_SHIFT
#define TIM_ADV_DCR_DBL_MASK                       TIM1_DCR_DBL_MASK
#define TIM_ADV_DCR_DBL(x)                         TIM1_DCR_DBL(x)

#define TIM_ADV_DCR_DBA_SHIFT                      TIM1_DCR_DBA_SHIFT
#define TIM_ADV_DCR_DBA_MASK                       TIM1_DCR_DBA_MASK
#define TIM_ADV_DCR_DBA(x)                         TIM1_DCR_DBA(x)

/*!
 * @brief TIM_ADV_DMAR Register Bit Definition
 */

#define TIM_ADV_DMAR_DMAB_SHIFT                    TIM1_DMAR_DMAB_SHIFT
#define TIM_ADV_DMAR_DMAB_MASK                     TIM1_DMAR_DMAB_MASK
#define TIM_ADV_DMAR_DMAB(x)                       TIM1_DMAR_DMAB(x)

/*!
 * @brief TIM_ADV_CCMR3 Register Bit Definition
 */

#define TIM_ADV_CCMR3_OC5M_SHIFT                   TIM1_CCMR3_OC5M_SHIFT
#define TIM_ADV_CCMR3_OC5M_MASK                    TIM1_CCMR3_OC5M_MASK
#define TIM_ADV_CCMR3_OC5M(x)                      TIM1_CCMR3_OC5M(x)

#define TIM_ADV_CCMR3_OC5PE_SHIFT                  TIM1_CCMR3_OC5PE_SHIFT
#define TIM_ADV_CCMR3_OC5PE_MASK                   TIM1_CCMR3_OC5PE_MASK
#define TIM_ADV_CCMR3_OC5PE(x)                     TIM1_CCMR3_OC5PE(x)

#define TIM_ADV_CCMR3_OC5FE_SHIFT                  TIM1_CCMR3_OC5FE_SHIFT
#define TIM_ADV_CCMR3_OC5FE_MASK                   TIM1_CCMR3_OC5FE_MASK
#define TIM_ADV_CCMR3_OC5FE(x)                     TIM1_CCMR3_OC5FE(x)

/*!
 * @brief TIM_ADV_CCR5 Register Bit Definition
 */

#define TIM_ADV_CCR5_CCR5_SHIFT                    TIM1_CCR5_CCR5_SHIFT
#define TIM_ADV_CCR5_CCR5_MASK                     TIM1_CCR5_CCR5_MASK
#define TIM_ADV_CCR5_CCR5(x)                       TIM1_CCR5_CCR5(x)

/*!
 * @brief TIM_ADV_PDER Register Bit Definition
 */

#define TIM_ADV_PDER_CCR5SHIFTEN_SHIFT             TIM1_PDER_CCR5SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR5SHIFTEN_MASK              TIM1_PDER_CCR5SHIFTEN_MASK
#define TIM_ADV_PDER_CCR5SHIFTEN(x)                TIM1_PDER_CCR5SHIFTEN(x)

#define TIM_ADV_PDER_CCR4SHIFTEN_SHIFT             TIM1_PDER_CCR4SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR4SHIFTEN_MASK              TIM1_PDER_CCR4SHIFTEN_MASK
#define TIM_ADV_PDER_CCR4SHIFTEN(x)                TIM1_PDER_CCR4SHIFTEN(x)

#define TIM_ADV_PDER_CCR3SHIFTEN_SHIFT             TIM1_PDER_CCR3SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR3SHIFTEN_MASK              TIM1_PDER_CCR3SHIFTEN_MASK
#define TIM_ADV_PDER_CCR3SHIFTEN(x)                TIM1_PDER_CCR3SHIFTEN(x)

#define TIM_ADV_PDER_CCR2SHIFTEN_SHIFT             TIM1_PDER_CCR2SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR2SHIFTEN_MASK              TIM1_PDER_CCR2SHIFTEN_MASK
#define TIM_ADV_PDER_CCR2SHIFTEN(x)                TIM1_PDER_CCR2SHIFTEN(x)

