LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_16B_CCMR1_OC1M_SHIFT                   TIM3_CCMR1_OC1M_SHIFT
#define TIM_16B_CCMR1_OC1M_MASK                    TIM3_CCMR1_OC1M_MASK
#define TIM_16B_CCMR1_OC1M(x)                      TIM3_CCMR1_OC1M(x)

#define TIM_16B_CCMR1_OC1PE_SHIFT                  TIM3_CCMR1_OC1PE_SHIFT
#define TIM_16B_CCMR1_OC1PE_MASK                   TIM3_CCMR1_OC1PE_MASK
#define TIM_16B_CCMR1_OC1PE(x)                     TIM3_CCMR1_OC1PE(x)

#define TIM_16B_CCMR1_OC1FE_SHIFT                  TIM3_CCMR1_OC1FE_SHIFT
#define TIM_16B_CCMR1_OC1FE_MASK                   TIM3_CCMR1_OC1FE_MASK
#define TIM_16B_CCMR1_OC1FE(x)                     TIM3_CCMR1_OC1FE(x)

#define TIM_16B_CCMR1_CC1S_SHIFT                   TIM3_CCMR1_CC1S_SHIFT
#define TIM_16B_CCMR1_CC1S_MASK                    TIM3_CCMR1_CC1S_MASK
#define TIM_16B_CCMR1_CC1S(x)                      TIM3_CCMR1_CC1S(x)

/*!
 * @brief TIM_16B_CCMR1 Register Bit Definition
 */

#define TIM_16B_CCMR1_IC2F_SHIFT                   TIM3_CCMR1_IC2F_SHIFT
#define TIM_16B_CCMR1_IC2F_MASK                    TIM3_CCMR1_IC2F_MASK
#define TIM_16B_CCMR1_IC2F(x)                      TIM3_CCMR1_IC2F(x)

#define TIM_16B_CCMR1_IC2PSC_SHIFT                 TIM3_CCMR1_IC2PSC_SHIFT
#define TIM_16B_CCMR1_IC2PSC_MASK                  TIM3_CCMR1_IC2PSC_MASK
#define TIM_16B_CCMR1_IC2PSC(x)                    TIM3_CCMR1_IC2PSC(x)

#define TIM_16B_CCMR1_CC2S_SHIFT                   TIM3_CCMR1_CC2S_SHIFT
#define TIM_16B_CCMR1_CC2S_MASK                    TIM3_CCMR1_CC2S_MASK
#define TIM_16B_CCMR1_CC2S(x)                      TIM3_CCMR1_CC2S(x)

#define TIM_16B_CCMR1_IC1F_SHIFT                   TIM3_CCMR1_IC1F_SHIFT
#define TIM_16B_CCMR1_IC1F_MASK                    TIM3_CCMR1_IC1F_MASK
#define TIM_16B_CCMR1_IC1F(x)                      TIM3_CCMR1_IC1F(x)

#define TIM_16B_CCMR1_IC1PSC_SHIFT                 TIM3_CCMR1_IC1PSC_SHIFT
#define TIM_16B_CCMR1_IC1PSC_MASK                  TIM3_CCMR1_IC1PSC_MASK
#define TIM_16B_CCMR1_IC1PSC(x)                    TIM3_CCMR1_IC1PSC(x)

#define TIM_16B_CCMR1_CC1S_SHIFT                   TIM3_CCMR1_CC1S_SHIFT
#define TIM_16B_CCMR1_CC1S_MASK                    TIM3_CCMR1_CC1S_MASK
#define TIM_16B_CCMR1_CC1S(x)                      TIM3_CCMR1_CC1S(x)

/*!
 * @brief TIM_16B_CCMR2 Register Bit Definition
 */

#define TIM_16B_CCMR2_OC4CE_SHIFT                  TIM3_CCMR2_OC4CE_SHIFT
#define TIM_16B_CCMR2_OC4CE_MASK                   TIM3_CCMR2_OC4CE_MASK
#define TIM_16B_CCMR2_OC4CE(x)                     TIM3_CCMR2_OC4CE(x)

#define TIM_16B_CCMR2_OC4M_SHIFT                   TIM3_CCMR2_OC4M_SHIFT
#define TIM_16B_CCMR2_OC4M_MASK                    TIM3_CCMR2_OC4M_MASK
#define TIM_16B_CCMR2_OC4M(x)                      TIM3_CCMR2_OC4M(x)

#define TIM_16B_CCMR2_OC4PE_SHIFT                  TIM3_CCMR2_OC4PE_SHIFT
#define TIM_16B_CCMR2_OC4PE_MASK                   TIM3_CCMR2_OC4PE_MASK
#define TIM_16B_CCMR2_OC4PE(x)                     TIM3_CCMR2_OC4PE(x)

#define TIM_16B_CCMR2_OC4FE_SHIFT                  TIM3_CCMR2_OC4FE_SHIFT
#define TIM_16B_CCMR2_OC4FE_MASK                   TIM3_CCMR2_OC4FE_MASK
#define TIM_16B_CCMR2_OC4FE(x)                     TIM3_CCMR2_OC4FE(x)

#define TIM_16B_CCMR2_CC4S_SHIFT                   TIM3_CCMR2_CC4S_SHIFT
#define TIM_16B_CCMR2_CC4S_MASK                    TIM3_CCMR2_CC4S_MASK
#define TIM_16B_CCMR2_CC4S(x)                      TIM3_CCMR2_CC4S(x)

#define TIM_16B_CCMR2_OC3CE_SHIFT                  TIM3_CCMR2_OC3CE_SHIFT
#define TIM_16B_CCMR2_OC3CE_MASK                   TIM3_CCMR2_OC3CE_MASK
#define TIM_16B_CCMR2_OC3CE(x)                     TIM3_CCMR2_OC3CE(x)

#define TIM_16B_CCMR2_OC3M_SHIFT                   TIM3_CCMR2_OC3M_SHIFT
#define TIM_16B_CCMR2_OC3M_MASK                    TIM3_CCMR2_OC3M_MASK
#define TIM_16B_CCMR2_OC3M(x)                      TIM3_CCMR2_OC3M(x)

#define TIM_16B_CCMR2_OC3PE_SHIFT                  TIM3_CCMR2_OC3PE_SHIFT
#define TIM_16B_CCMR2_OC3PE_MASK                   TIM3_CCMR2_OC3PE_MASK
#define TIM_16B_CCMR2_OC3PE(x)                     TIM3_CCMR2_OC3PE(x)

#define TIM_16B_CCMR2_OC3FE_SHIFT                  TIM3_CCMR2_OC3FE_SHIFT
#define TIM_16B_CCMR2_OC3FE_MASK                   TIM3_CCMR2_OC3FE_MASK
#define TIM_16B_CCMR2_OC3FE(x)                     TIM3_CCMR2_OC3FE(x)

#define TIM_16B_CCMR2_CC3S_SHIFT                   TIM3_CCMR2_CC3S_SHIFT
#define TIM_16B_CCMR2_CC3S_MASK                    TIM3_CCMR2_CC3S_MASK
#define TIM_16B_CCMR2_CC3S(x)                      TIM3_CCMR2_CC3S(x)

/*!
 * @brief TIM_16B_CCMR2 Register Bit Definition
 */

#define TIM_16B_CCMR2_IC4F_SHIFT                   TIM3_CCMR2_IC4F_SHIFT
#define TIM_16B_CCMR2_IC4F_MASK                    TIM3_CCMR2_IC4F_MASK
#define TIM_16B_CCMR2_IC4F(x)                      TIM3_CCMR2_IC4F(x)

#define TIM_16B_CCMR2_IC4PSC_SHIFT                 TIM3_CCMR2_IC4PSC_SHIFT
#define TIM_16B_CCMR2_IC4PSC_MASK                  TIM3_CCMR2_IC4PSC_MASK
#define TIM_16B_CCMR2_IC4PSC(x)                    TIM3_CCMR2_IC4PSC(x)

#define TIM_16B_CCMR2_CC4S_SHIFT                   TIM3_CCMR2_CC4S_SHIFT
#define TIM_16B_CCMR2_CC4S_MASK                    TIM3_CCMR2_CC4S_MASK
#define TIM_16B_CCMR2_CC4S(x)                      TIM3_CCMR2_CC4S(x)

#define TIM_16B_CCMR2_IC3F_SHIFT                   TIM3_CCMR2_IC3F_SHIFT
#define TIM_16B_CCMR2_IC3F_MASK                    TIM3_CCMR2_IC3F_MASK
#define TIM_16B_CCMR2_IC3F(x)                      TIM3_CCMR2_IC3F(x)

#define TIM_16B_CCMR2_IC3PSC_SHIFT                 TIM3_CCMR2_IC3PSC_SHIFT
#define TIM_16B_CCMR2_IC3PSC_MASK                  TIM3_CCMR2_IC3PSC_MASK
#define TIM_16B_CCMR2_IC3PSC(x)                    TIM3_CCMR2_IC3PSC(x)

#define TIM_16B_CCMR2_CC3S_SHIFT                   TIM3_CCMR2_CC3S_SHIFT
#define TIM_16B_CCMR2_CC3S_MASK                    TIM3_CCMR2_CC3S_MASK
#define TIM_16B_CCMR2_CC3S(x)                      TIM3_CCMR2_CC3S(x)

/*!
 * @brief TIM_16B_CCER Register Bit Definition
 */

#define TIM_16B_CCER_CC4NP_SHIFT                   TIM3_CCER_CC4NP_SHIFT
#define TIM_16B_CCER_CC4NP_MASK                    TIM3_CCER_CC4NP_MASK
#define TIM_16B_CCER_CC4NP(x)                      TIM3_CCER_CC4NP(x)

