LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_16B_CCER_CC4P_SHIFT                    TIM3_CCER_CC4P_SHIFT
#define TIM_16B_CCER_CC4P_MASK                     TIM3_CCER_CC4P_MASK
#define TIM_16B_CCER_CC4P(x)                       TIM3_CCER_CC4P(x)

#define TIM_16B_CCER_CC4E_SHIFT                    TIM3_CCER_CC4E_SHIFT
#define TIM_16B_CCER_CC4E_MASK                     TIM3_CCER_CC4E_MASK
#define TIM_16B_CCER_CC4E(x)                       TIM3_CCER_CC4E(x)

#define TIM_16B_CCER_CC3NP_SHIFT                   TIM3_CCER_CC3NP_SHIFT
#define TIM_16B_CCER_CC3NP_MASK                    TIM3_CCER_CC3NP_MASK
#define TIM_16B_CCER_CC3NP(x)                      TIM3_CCER_CC3NP(x)

#define TIM_16B_CCER_CC3P_SHIFT                    TIM3_CCER_CC3P_SHIFT
#define TIM_16B_CCER_CC3P_MASK                     TIM3_CCER_CC3P_MASK
#define TIM_16B_CCER_CC3P(x)                       TIM3_CCER_CC3P(x)

#define TIM_16B_CCER_CC3E_SHIFT                    TIM3_CCER_CC3E_SHIFT
#define TIM_16B_CCER_CC3E_MASK                     TIM3_CCER_CC3E_MASK
#define TIM_16B_CCER_CC3E(x)                       TIM3_CCER_CC3E(x)

#define TIM_16B_CCER_CC2NP_SHIFT                   TIM3_CCER_CC2NP_SHIFT
#define TIM_16B_CCER_CC2NP_MASK                    TIM3_CCER_CC2NP_MASK
#define TIM_16B_CCER_CC2NP(x)                      TIM3_CCER_CC2NP(x)

#define TIM_16B_CCER_CC2P_SHIFT                    TIM3_CCER_CC2P_SHIFT
#define TIM_16B_CCER_CC2P_MASK                     TIM3_CCER_CC2P_MASK
#define TIM_16B_CCER_CC2P(x)                       TIM3_CCER_CC2P(x)

#define TIM_16B_CCER_CC2E_SHIFT                    TIM3_CCER_CC2E_SHIFT
#define TIM_16B_CCER_CC2E_MASK                     TIM3_CCER_CC2E_MASK
#define TIM_16B_CCER_CC2E(x)                       TIM3_CCER_CC2E(x)

#define TIM_16B_CCER_CC1NP_SHIFT                   TIM3_CCER_CC1NP_SHIFT
#define TIM_16B_CCER_CC1NP_MASK                    TIM3_CCER_CC1NP_MASK
#define TIM_16B_CCER_CC1NP(x)                      TIM3_CCER_CC1NP(x)

#define TIM_16B_CCER_CC1P_SHIFT                    TIM3_CCER_CC1P_SHIFT
#define TIM_16B_CCER_CC1P_MASK                     TIM3_CCER_CC1P_MASK
#define TIM_16B_CCER_CC1P(x)                       TIM3_CCER_CC1P(x)

#define TIM_16B_CCER_CC1E_SHIFT                    TIM3_CCER_CC1E_SHIFT
#define TIM_16B_CCER_CC1E_MASK                     TIM3_CCER_CC1E_MASK
#define TIM_16B_CCER_CC1E(x)                       TIM3_CCER_CC1E(x)

/*!
 * @brief TIM_16B_CNT Register Bit Definition
 */

#define TIM_16B_CNT_CNT_SHIFT                      TIM3_CNT_CNT_SHIFT
#define TIM_16B_CNT_CNT_MASK                       TIM3_CNT_CNT_MASK
#define TIM_16B_CNT_CNT(x)                         TIM3_CNT_CNT(x)

/*!
 * @brief TIM_16B_PSC Register Bit Definition
 */

#define TIM_16B_PSC_PSC_SHIFT                      TIM3_PSC_PSC_SHIFT
#define TIM_16B_PSC_PSC_MASK                       TIM3_PSC_PSC_MASK
#define TIM_16B_PSC_PSC(x)                         TIM3_PSC_PSC(x)

/*!
 * @brief TIM_16B_ARR Register Bit Definition
 */

#define TIM_16B_ARR_ARR_SHIFT                      TIM3_ARR_ARR_SHIFT
#define TIM_16B_ARR_ARR_MASK                       TIM3_ARR_ARR_MASK
#define TIM_16B_ARR_ARR(x)                         TIM3_ARR_ARR(x)

/*!
 * @brief TIM_16B_CCR1 Register Bit Definition
 */

#define TIM_16B_CCR1_CCR1_SHIFT                    TIM3_CCR1_CCR1_SHIFT
#define TIM_16B_CCR1_CCR1_MASK                     TIM3_CCR1_CCR1_MASK
#define TIM_16B_CCR1_CCR1(x)                       TIM3_CCR1_CCR1(x)

/*!
 * @brief TIM_16B_CCR2 Register Bit Definition
 */

#define TIM_16B_CCR2_CCR2_SHIFT                    TIM3_CCR2_CCR2_SHIFT
#define TIM_16B_CCR2_CCR2_MASK                     TIM3_CCR2_CCR2_MASK
#define TIM_16B_CCR2_CCR2(x)                       TIM3_CCR2_CCR2(x)

/*!
 * @brief TIM_16B_CCR3 Register Bit Definition
 */

#define TIM_16B_CCR3_CCR3_SHIFT                    TIM3_CCR3_CCR3_SHIFT
#define TIM_16B_CCR3_CCR3_MASK                     TIM3_CCR3_CCR3_MASK
#define TIM_16B_CCR3_CCR3(x)                       TIM3_CCR3_CCR3(x)

/*!
 * @brief TIM_16B_CCR4 Register Bit Definition
 */

#define TIM_16B_CCR4_CCR4_SHIFT                    TIM3_CCR4_CCR4_SHIFT
#define TIM_16B_CCR4_CCR4_MASK                     TIM3_CCR4_CCR4_MASK
#define TIM_16B_CCR4_CCR4(x)                       TIM3_CCR4_CCR4(x)

/*!
 * @brief TIM_16B_DCR Register Bit Definition
 */

#define TIM_16B_DCR_DBL_SHIFT                      TIM3_DCR_DBL_SHIFT
#define TIM_16B_DCR_DBL_MASK                       TIM3_DCR_DBL_MASK
#define TIM_16B_DCR_DBL(x)                         TIM3_DCR_DBL(x)

#define TIM_16B_DCR_DBA_SHIFT                      TIM3_DCR_DBA_SHIFT
#define TIM_16B_DCR_DBA_MASK                       TIM3_DCR_DBA_MASK
#define TIM_16B_DCR_DBA(x)                         TIM3_DCR_DBA(x)

/*!
 * @brief TIM_16B_DMAR Register Bit Definition
 */

#define TIM_16B_DMAR_DMAB_SHIFT                    TIM3_DMAR_DMAB_SHIFT
#define TIM_16B_DMAR_DMAB_MASK                     TIM3_DMAR_DMAB_MASK
#define TIM_16B_DMAR_DMAB(x)                       TIM3_DMAR_DMAB(x)

/*!
 * @}
 */ /* end of group TIM_16B_Register_Masks */

/*******************************************************************************
 * TIM_32B Type
 ******************************************************************************/
/*!
 * @addtogroup TIM_32B_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_32B_CR1 Register Bit Definition
 */

#define TIM_32B_CR1_CKD_SHIFT                      TIM2_CR1_CKD_SHIFT
#define TIM_32B_CR1_CKD_MASK                       TIM2_CR1_CKD_MASK
#define TIM_32B_CR1_CKD(x)                         TIM2_CR1_CKD(x)

#define TIM_32B_CR1_ARPE_SHIFT                     TIM2_CR1_ARPE_SHIFT
#define TIM_32B_CR1_ARPE_MASK                      TIM2_CR1_ARPE_MASK
#define TIM_32B_CR1_ARPE(x)                        TIM2_CR1_ARPE(x)

#define TIM_32B_CR1_CMS_SHIFT                      TIM2_CR1_CMS_SHIFT
#define TIM_32B_CR1_CMS_MASK                       TIM2_CR1_CMS_MASK
#define TIM_32B_CR1_CMS(x)                         TIM2_CR1_CMS(x)

#define TIM_32B_CR1_DIR_SHIFT                      TIM2_CR1_DIR_SHIFT
#define TIM_32B_CR1_DIR_MASK                       TIM2_CR1_DIR_MASK
#define TIM_32B_CR1_DIR(x)                         TIM2_CR1_DIR(x)

#define TIM_32B_CR1_OPM_SHIFT                      TIM2_CR1_OPM_SHIFT
#define TIM_32B_CR1_OPM_MASK                       TIM2_CR1_OPM_MASK
#define TIM_32B_CR1_OPM(x)                         TIM2_CR1_OPM(x)

