LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_32B_CR1_URS_SHIFT                      TIM2_CR1_URS_SHIFT
#define TIM_32B_CR1_URS_MASK                       TIM2_CR1_URS_MASK
#define TIM_32B_CR1_URS(x)                         TIM2_CR1_URS(x)

#define TIM_32B_CR1_UDIS_SHIFT                     TIM2_CR1_UDIS_SHIFT
#define TIM_32B_CR1_UDIS_MASK                      TIM2_CR1_UDIS_MASK
#define TIM_32B_CR1_UDIS(x)                        TIM2_CR1_UDIS(x)

#define TIM_32B_CR1_CEN_SHIFT                      TIM2_CR1_CEN_SHIFT
#define TIM_32B_CR1_CEN_MASK                       TIM2_CR1_CEN_MASK
#define TIM_32B_CR1_CEN(x)                         TIM2_CR1_CEN(x)

/*!
 * @brief TIM_32B_CR2 Register Bit Definition
 */

#define TIM_32B_CR2_TI1S_SHIFT                     TIM2_CR2_TI1S_SHIFT
#define TIM_32B_CR2_TI1S_MASK                      TIM2_CR2_TI1S_MASK
#define TIM_32B_CR2_TI1S(x)                        TIM2_CR2_TI1S(x)

#define TIM_32B_CR2_MMS_SHIFT                      TIM2_CR2_MMS_SHIFT
#define TIM_32B_CR2_MMS_MASK                       TIM2_CR2_MMS_MASK
#define TIM_32B_CR2_MMS(x)                         TIM2_CR2_MMS(x)

#define TIM_32B_CR2_CCDS_SHIFT                     TIM2_CR2_CCDS_SHIFT
#define TIM_32B_CR2_CCDS_MASK                      TIM2_CR2_CCDS_MASK
#define TIM_32B_CR2_CCDS(x)                        TIM2_CR2_CCDS(x)

/*!
 * @brief TIM_32B_SMCR Register Bit Definition
 */

#define TIM_32B_SMCR_ETP_SHIFT                     TIM2_SMCR_ETP_SHIFT
#define TIM_32B_SMCR_ETP_MASK                      TIM2_SMCR_ETP_MASK
#define TIM_32B_SMCR_ETP(x)                        TIM2_SMCR_ETP(x)

#define TIM_32B_SMCR_ECE_SHIFT                     TIM2_SMCR_ECE_SHIFT
#define TIM_32B_SMCR_ECE_MASK                      TIM2_SMCR_ECE_MASK
#define TIM_32B_SMCR_ECE(x)                        TIM2_SMCR_ECE(x)

#define TIM_32B_SMCR_ETPS_SHIFT                    TIM2_SMCR_ETPS_SHIFT
#define TIM_32B_SMCR_ETPS_MASK                     TIM2_SMCR_ETPS_MASK
#define TIM_32B_SMCR_ETPS(x)                       TIM2_SMCR_ETPS(x)

#define TIM_32B_SMCR_ETF_SHIFT                     TIM2_SMCR_ETF_SHIFT
#define TIM_32B_SMCR_ETF_MASK                      TIM2_SMCR_ETF_MASK
#define TIM_32B_SMCR_ETF(x)                        TIM2_SMCR_ETF(x)

#define TIM_32B_SMCR_MSM_SHIFT                     TIM2_SMCR_MSM_SHIFT
#define TIM_32B_SMCR_MSM_MASK                      TIM2_SMCR_MSM_MASK
#define TIM_32B_SMCR_MSM(x)                        TIM2_SMCR_MSM(x)

#define TIM_32B_SMCR_TS_SHIFT                      TIM2_SMCR_TS_SHIFT
#define TIM_32B_SMCR_TS_MASK                       TIM2_SMCR_TS_MASK
#define TIM_32B_SMCR_TS(x)                         TIM2_SMCR_TS(x)

#define TIM_32B_SMCR_OCCS_SHIFT                    TIM2_SMCR_OCCS_SHIFT
#define TIM_32B_SMCR_OCCS_MASK                     TIM2_SMCR_OCCS_MASK
#define TIM_32B_SMCR_OCCS(x)                       TIM2_SMCR_OCCS(x)

#define TIM_32B_SMCR_SMS_SHIFT                     TIM2_SMCR_SMS_SHIFT
#define TIM_32B_SMCR_SMS_MASK                      TIM2_SMCR_SMS_MASK
#define TIM_32B_SMCR_SMS(x)                        TIM2_SMCR_SMS(x)

/*!
 * @brief TIM_32B_DIER Register Bit Definition
 */

#define TIM_32B_DIER_TDE_SHIFT                     TIM2_DIER_TDE_SHIFT
#define TIM_32B_DIER_TDE_MASK                      TIM2_DIER_TDE_MASK
#define TIM_32B_DIER_TDE(x)                        TIM2_DIER_TDE(x)

#define TIM_32B_DIER_CC4DE_SHIFT                   TIM2_DIER_CC4DE_SHIFT
#define TIM_32B_DIER_CC4DE_MASK                    TIM2_DIER_CC4DE_MASK
#define TIM_32B_DIER_CC4DE(x)                      TIM2_DIER_CC4DE(x)

#define TIM_32B_DIER_CC3DE_SHIFT                   TIM2_DIER_CC3DE_SHIFT
#define TIM_32B_DIER_CC3DE_MASK                    TIM2_DIER_CC3DE_MASK
#define TIM_32B_DIER_CC3DE(x)                      TIM2_DIER_CC3DE(x)

#define TIM_32B_DIER_CC2DE_SHIFT                   TIM2_DIER_CC2DE_SHIFT
#define TIM_32B_DIER_CC2DE_MASK                    TIM2_DIER_CC2DE_MASK
#define TIM_32B_DIER_CC2DE(x)                      TIM2_DIER_CC2DE(x)

#define TIM_32B_DIER_CC1DE_SHIFT                   TIM2_DIER_CC1DE_SHIFT
#define TIM_32B_DIER_CC1DE_MASK                    TIM2_DIER_CC1DE_MASK
#define TIM_32B_DIER_CC1DE(x)                      TIM2_DIER_CC1DE(x)

#define TIM_32B_DIER_UDE_SHIFT                     TIM2_DIER_UDE_SHIFT
#define TIM_32B_DIER_UDE_MASK                      TIM2_DIER_UDE_MASK
#define TIM_32B_DIER_UDE(x)                        TIM2_DIER_UDE(x)

#define TIM_32B_DIER_TIE_SHIFT                     TIM2_DIER_TIE_SHIFT
#define TIM_32B_DIER_TIE_MASK                      TIM2_DIER_TIE_MASK
#define TIM_32B_DIER_TIE(x)                        TIM2_DIER_TIE(x)

#define TIM_32B_DIER_CC4IE_SHIFT                   TIM2_DIER_CC4IE_SHIFT
#define TIM_32B_DIER_CC4IE_MASK                    TIM2_DIER_CC4IE_MASK
#define TIM_32B_DIER_CC4IE(x)                      TIM2_DIER_CC4IE(x)

#define TIM_32B_DIER_CC3IE_SHIFT                   TIM2_DIER_CC3IE_SHIFT
#define TIM_32B_DIER_CC3IE_MASK                    TIM2_DIER_CC3IE_MASK
#define TIM_32B_DIER_CC3IE(x)                      TIM2_DIER_CC3IE(x)

#define TIM_32B_DIER_CC2IE_SHIFT                   TIM2_DIER_CC2IE_SHIFT
#define TIM_32B_DIER_CC2IE_MASK                    TIM2_DIER_CC2IE_MASK
#define TIM_32B_DIER_CC2IE(x)                      TIM2_DIER_CC2IE(x)

#define TIM_32B_DIER_CC1IE_SHIFT                   TIM2_DIER_CC1IE_SHIFT
#define TIM_32B_DIER_CC1IE_MASK                    TIM2_DIER_CC1IE_MASK
#define TIM_32B_DIER_CC1IE(x)                      TIM2_DIER_CC1IE(x)

#define TIM_32B_DIER_UIE_SHIFT                     TIM2_DIER_UIE_SHIFT
#define TIM_32B_DIER_UIE_MASK                      TIM2_DIER_UIE_MASK
#define TIM_32B_DIER_UIE(x)                        TIM2_DIER_UIE(x)

/*!
 * @brief TIM_32B_SR Register Bit Definition
 */

#define TIM_32B_SR_CC4OF_SHIFT                     TIM2_SR_CC4OF_SHIFT
#define TIM_32B_SR_CC4OF_MASK                      TIM2_SR_CC4OF_MASK
#define TIM_32B_SR_CC4OF(x)                        TIM2_SR_CC4OF(x)

#define TIM_32B_SR_CC3OF_SHIFT                     TIM2_SR_CC3OF_SHIFT
#define TIM_32B_SR_CC3OF_MASK                      TIM2_SR_CC3OF_MASK
#define TIM_32B_SR_CC3OF(x)                        TIM2_SR_CC3OF(x)

