LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_32B_SR_CC2OF_SHIFT                     TIM2_SR_CC2OF_SHIFT
#define TIM_32B_SR_CC2OF_MASK                      TIM2_SR_CC2OF_MASK
#define TIM_32B_SR_CC2OF(x)                        TIM2_SR_CC2OF(x)

#define TIM_32B_SR_CC1OF_SHIFT                     TIM2_SR_CC1OF_SHIFT
#define TIM_32B_SR_CC1OF_MASK                      TIM2_SR_CC1OF_MASK
#define TIM_32B_SR_CC1OF(x)                        TIM2_SR_CC1OF(x)

#define TIM_32B_SR_TIF_SHIFT                       TIM2_SR_TIF_SHIFT
#define TIM_32B_SR_TIF_MASK                        TIM2_SR_TIF_MASK
#define TIM_32B_SR_TIF(x)                          TIM2_SR_TIF(x)

#define TIM_32B_SR_CC4IF_SHIFT                     TIM2_SR_CC4IF_SHIFT
#define TIM_32B_SR_CC4IF_MASK                      TIM2_SR_CC4IF_MASK
#define TIM_32B_SR_CC4IF(x)                        TIM2_SR_CC4IF(x)

#define TIM_32B_SR_CC3IF_SHIFT                     TIM2_SR_CC3IF_SHIFT
#define TIM_32B_SR_CC3IF_MASK                      TIM2_SR_CC3IF_MASK
#define TIM_32B_SR_CC3IF(x)                        TIM2_SR_CC3IF(x)

#define TIM_32B_SR_CC2IF_SHIFT                     TIM2_SR_CC2IF_SHIFT
#define TIM_32B_SR_CC2IF_MASK                      TIM2_SR_CC2IF_MASK
#define TIM_32B_SR_CC2IF(x)                        TIM2_SR_CC2IF(x)

#define TIM_32B_SR_CC1IF_SHIFT                     TIM2_SR_CC1IF_SHIFT
#define TIM_32B_SR_CC1IF_MASK                      TIM2_SR_CC1IF_MASK
#define TIM_32B_SR_CC1IF(x)                        TIM2_SR_CC1IF(x)

#define TIM_32B_SR_UIF_SHIFT                       TIM2_SR_UIF_SHIFT
#define TIM_32B_SR_UIF_MASK                        TIM2_SR_UIF_MASK
#define TIM_32B_SR_UIF(x)                          TIM2_SR_UIF(x)

/*!
 * @brief TIM_32B_EGR Register Bit Definition
 */

#define TIM_32B_EGR_TG_SHIFT                       TIM2_EGR_TG_SHIFT
#define TIM_32B_EGR_TG_MASK                        TIM2_EGR_TG_MASK
#define TIM_32B_EGR_TG(x)                          TIM2_EGR_TG(x)

#define TIM_32B_EGR_COMG_SHIFT                     TIM2_EGR_COMG_SHIFT
#define TIM_32B_EGR_COMG_MASK                      TIM2_EGR_COMG_MASK
#define TIM_32B_EGR_COMG(x)                        TIM2_EGR_COMG(x)

#define TIM_32B_EGR_CC4G_SHIFT                     TIM2_EGR_CC4G_SHIFT
#define TIM_32B_EGR_CC4G_MASK                      TIM2_EGR_CC4G_MASK
#define TIM_32B_EGR_CC4G(x)                        TIM2_EGR_CC4G(x)

#define TIM_32B_EGR_CC3G_SHIFT                     TIM2_EGR_CC3G_SHIFT
#define TIM_32B_EGR_CC3G_MASK                      TIM2_EGR_CC3G_MASK
#define TIM_32B_EGR_CC3G(x)                        TIM2_EGR_CC3G(x)

#define TIM_32B_EGR_CC2G_SHIFT                     TIM2_EGR_CC2G_SHIFT
#define TIM_32B_EGR_CC2G_MASK                      TIM2_EGR_CC2G_MASK
#define TIM_32B_EGR_CC2G(x)                        TIM2_EGR_CC2G(x)

#define TIM_32B_EGR_CC1G_SHIFT                     TIM2_EGR_CC1G_SHIFT
#define TIM_32B_EGR_CC1G_MASK                      TIM2_EGR_CC1G_MASK
#define TIM_32B_EGR_CC1G(x)                        TIM2_EGR_CC1G(x)

#define TIM_32B_EGR_UG_SHIFT                       TIM2_EGR_UG_SHIFT
#define TIM_32B_EGR_UG_MASK                        TIM2_EGR_UG_MASK
#define TIM_32B_EGR_UG(x)                          TIM2_EGR_UG(x)

/*!
 * @brief TIM_32B_CCMR1 Register Bit Definition
 */

#define TIM_32B_CCMR1_OC2CE_SHIFT                  TIM2_CCMR1_OC2CE_SHIFT
#define TIM_32B_CCMR1_OC2CE_MASK                   TIM2_CCMR1_OC2CE_MASK
#define TIM_32B_CCMR1_OC2CE(x)                     TIM2_CCMR1_OC2CE(x)

#define TIM_32B_CCMR1_OC2M_SHIFT                   TIM2_CCMR1_OC2M_SHIFT
#define TIM_32B_CCMR1_OC2M_MASK                    TIM2_CCMR1_OC2M_MASK
#define TIM_32B_CCMR1_OC2M(x)                      TIM2_CCMR1_OC2M(x)

#define TIM_32B_CCMR1_OC2PE_SHIFT                  TIM2_CCMR1_OC2PE_SHIFT
#define TIM_32B_CCMR1_OC2PE_MASK                   TIM2_CCMR1_OC2PE_MASK
#define TIM_32B_CCMR1_OC2PE(x)                     TIM2_CCMR1_OC2PE(x)

#define TIM_32B_CCMR1_OC2FE_SHIFT                  TIM2_CCMR1_OC2FE_SHIFT
#define TIM_32B_CCMR1_OC2FE_MASK                   TIM2_CCMR1_OC2FE_MASK
#define TIM_32B_CCMR1_OC2FE(x)                     TIM2_CCMR1_OC2FE(x)

#define TIM_32B_CCMR1_CC2S_SHIFT                   TIM2_CCMR1_CC2S_SHIFT
#define TIM_32B_CCMR1_CC2S_MASK                    TIM2_CCMR1_CC2S_MASK
#define TIM_32B_CCMR1_CC2S(x)                      TIM2_CCMR1_CC2S(x)

#define TIM_32B_CCMR1_OC1CE_SHIFT                  TIM2_CCMR1_OC1CE_SHIFT
#define TIM_32B_CCMR1_OC1CE_MASK                   TIM2_CCMR1_OC1CE_MASK
#define TIM_32B_CCMR1_OC1CE(x)                     TIM2_CCMR1_OC1CE(x)

#define TIM_32B_CCMR1_OC1M_SHIFT                   TIM2_CCMR1_OC1M_SHIFT
#define TIM_32B_CCMR1_OC1M_MASK                    TIM2_CCMR1_OC1M_MASK
#define TIM_32B_CCMR1_OC1M(x)                      TIM2_CCMR1_OC1M(x)

#define TIM_32B_CCMR1_OC1PE_SHIFT                  TIM2_CCMR1_OC1PE_SHIFT
#define TIM_32B_CCMR1_OC1PE_MASK                   TIM2_CCMR1_OC1PE_MASK
#define TIM_32B_CCMR1_OC1PE(x)                     TIM2_CCMR1_OC1PE(x)

#define TIM_32B_CCMR1_OC1FE_SHIFT                  TIM2_CCMR1_OC1FE_SHIFT
#define TIM_32B_CCMR1_OC1FE_MASK                   TIM2_CCMR1_OC1FE_MASK
#define TIM_32B_CCMR1_OC1FE(x)                     TIM2_CCMR1_OC1FE(x)

#define TIM_32B_CCMR1_CC1S_SHIFT                   TIM2_CCMR1_CC1S_SHIFT
#define TIM_32B_CCMR1_CC1S_MASK                    TIM2_CCMR1_CC1S_MASK
#define TIM_32B_CCMR1_CC1S(x)                      TIM2_CCMR1_CC1S(x)

/*!
 * @brief TIM_32B_CCMR1 Register Bit Definition
 */

#define TIM_32B_CCMR1_IC2F_SHIFT                   TIM2_CCMR1_IC2F_SHIFT
#define TIM_32B_CCMR1_IC2F_MASK                    TIM2_CCMR1_IC2F_MASK
#define TIM_32B_CCMR1_IC2F(x)                      TIM2_CCMR1_IC2F(x)

#define TIM_32B_CCMR1_IC2PSC_SHIFT                 TIM2_CCMR1_IC2PSC_SHIFT
#define TIM_32B_CCMR1_IC2PSC_MASK                  TIM2_CCMR1_IC2PSC_MASK
#define TIM_32B_CCMR1_IC2PSC(x)                    TIM2_CCMR1_IC2PSC(x)

#define TIM_32B_CCMR1_CC2S_SHIFT                   TIM2_CCMR1_CC2S_SHIFT
#define TIM_32B_CCMR1_CC2S_MASK                    TIM2_CCMR1_CC2S_MASK
#define TIM_32B_CCMR1_CC2S(x)                      TIM2_CCMR1_CC2S(x)

#define TIM_32B_CCMR1_IC1F_SHIFT                   TIM2_CCMR1_IC1F_SHIFT
#define TIM_32B_CCMR1_IC1F_MASK                    TIM2_CCMR1_IC1F_MASK
#define TIM_32B_CCMR1_IC1F(x)                      TIM2_CCMR1_IC1F(x)

#define TIM_32B_CCMR1_IC1PSC_SHIFT                 TIM2_CCMR1_IC1PSC_SHIFT
#define TIM_32B_CCMR1_IC1PSC_MASK                  TIM2_CCMR1_IC1PSC_MASK
#define TIM_32B_CCMR1_IC1PSC(x)                    TIM2_CCMR1_IC1PSC(x)

#define TIM_32B_CCMR1_CC1S_SHIFT                   TIM2_CCMR1_CC1S_SHIFT
#define TIM_32B_CCMR1_CC1S_MASK                    TIM2_CCMR1_CC1S_MASK
#define TIM_32B_CCMR1_CC1S(x)                      TIM2_CCMR1_CC1S(x)

/*!
 * @brief TIM_32B_CCMR2 Register Bit Definition
 */

#define TIM_32B_CCMR2_OC4CE_SHIFT                  TIM2_CCMR2_OC4CE_SHIFT
#define TIM_32B_CCMR2_OC4CE_MASK                   TIM2_CCMR2_OC4CE_MASK
#define TIM_32B_CCMR2_OC4CE(x)                     TIM2_CCMR2_OC4CE(x)

