LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_32B_CCMR2_OC4M_SHIFT                   TIM2_CCMR2_OC4M_SHIFT
#define TIM_32B_CCMR2_OC4M_MASK                    TIM2_CCMR2_OC4M_MASK
#define TIM_32B_CCMR2_OC4M(x)                      TIM2_CCMR2_OC4M(x)

#define TIM_32B_CCMR2_OC4PE_SHIFT                  TIM2_CCMR2_OC4PE_SHIFT
#define TIM_32B_CCMR2_OC4PE_MASK                   TIM2_CCMR2_OC4PE_MASK
#define TIM_32B_CCMR2_OC4PE(x)                     TIM2_CCMR2_OC4PE(x)

#define TIM_32B_CCMR2_OC4FE_SHIFT                  TIM2_CCMR2_OC4FE_SHIFT
#define TIM_32B_CCMR2_OC4FE_MASK                   TIM2_CCMR2_OC4FE_MASK
#define TIM_32B_CCMR2_OC4FE(x)                     TIM2_CCMR2_OC4FE(x)

#define TIM_32B_CCMR2_CC4S_SHIFT                   TIM2_CCMR2_CC4S_SHIFT
#define TIM_32B_CCMR2_CC4S_MASK                    TIM2_CCMR2_CC4S_MASK
#define TIM_32B_CCMR2_CC4S(x)                      TIM2_CCMR2_CC4S(x)

#define TIM_32B_CCMR2_OC3CE_SHIFT                  TIM2_CCMR2_OC3CE_SHIFT
#define TIM_32B_CCMR2_OC3CE_MASK                   TIM2_CCMR2_OC3CE_MASK
#define TIM_32B_CCMR2_OC3CE(x)                     TIM2_CCMR2_OC3CE(x)

#define TIM_32B_CCMR2_OC3M_SHIFT                   TIM2_CCMR2_OC3M_SHIFT
#define TIM_32B_CCMR2_OC3M_MASK                    TIM2_CCMR2_OC3M_MASK
#define TIM_32B_CCMR2_OC3M(x)                      TIM2_CCMR2_OC3M(x)

#define TIM_32B_CCMR2_OC3PE_SHIFT                  TIM2_CCMR2_OC3PE_SHIFT
#define TIM_32B_CCMR2_OC3PE_MASK                   TIM2_CCMR2_OC3PE_MASK
#define TIM_32B_CCMR2_OC3PE(x)                     TIM2_CCMR2_OC3PE(x)

#define TIM_32B_CCMR2_OC3FE_SHIFT                  TIM2_CCMR2_OC3FE_SHIFT
#define TIM_32B_CCMR2_OC3FE_MASK                   TIM2_CCMR2_OC3FE_MASK
#define TIM_32B_CCMR2_OC3FE(x)                     TIM2_CCMR2_OC3FE(x)

#define TIM_32B_CCMR2_CC3S_SHIFT                   TIM2_CCMR2_CC3S_SHIFT
#define TIM_32B_CCMR2_CC3S_MASK                    TIM2_CCMR2_CC3S_MASK
#define TIM_32B_CCMR2_CC3S(x)                      TIM2_CCMR2_CC3S(x)

/*!
 * @brief TIM_32B_CCMR2 Register Bit Definition
 */

#define TIM_32B_CCMR2_IC4F_SHIFT                   TIM2_CCMR2_IC4F_SHIFT
#define TIM_32B_CCMR2_IC4F_MASK                    TIM2_CCMR2_IC4F_MASK
#define TIM_32B_CCMR2_IC4F(x)                      TIM2_CCMR2_IC4F(x)

#define TIM_32B_CCMR2_IC4PSC_SHIFT                 TIM2_CCMR2_IC4PSC_SHIFT
#define TIM_32B_CCMR2_IC4PSC_MASK                  TIM2_CCMR2_IC4PSC_MASK
#define TIM_32B_CCMR2_IC4PSC(x)                    TIM2_CCMR2_IC4PSC(x)

#define TIM_32B_CCMR2_CC4S_SHIFT                   TIM2_CCMR2_CC4S_SHIFT
#define TIM_32B_CCMR2_CC4S_MASK                    TIM2_CCMR2_CC4S_MASK
#define TIM_32B_CCMR2_CC4S(x)                      TIM2_CCMR2_CC4S(x)

#define TIM_32B_CCMR2_IC3F_SHIFT                   TIM2_CCMR2_IC3F_SHIFT
#define TIM_32B_CCMR2_IC3F_MASK                    TIM2_CCMR2_IC3F_MASK
#define TIM_32B_CCMR2_IC3F(x)                      TIM2_CCMR2_IC3F(x)

#define TIM_32B_CCMR2_IC3PSC_SHIFT                 TIM2_CCMR2_IC3PSC_SHIFT
#define TIM_32B_CCMR2_IC3PSC_MASK                  TIM2_CCMR2_IC3PSC_MASK
#define TIM_32B_CCMR2_IC3PSC(x)                    TIM2_CCMR2_IC3PSC(x)

#define TIM_32B_CCMR2_CC3S_SHIFT                   TIM2_CCMR2_CC3S_SHIFT
#define TIM_32B_CCMR2_CC3S_MASK                    TIM2_CCMR2_CC3S_MASK
#define TIM_32B_CCMR2_CC3S(x)                      TIM2_CCMR2_CC3S(x)

/*!
 * @brief TIM_32B_CCER Register Bit Definition
 */

#define TIM_32B_CCER_CC4NP_SHIFT                   TIM2_CCER_CC4NP_SHIFT
#define TIM_32B_CCER_CC4NP_MASK                    TIM2_CCER_CC4NP_MASK
#define TIM_32B_CCER_CC4NP(x)                      TIM2_CCER_CC4NP(x)

#define TIM_32B_CCER_CC4P_SHIFT                    TIM2_CCER_CC4P_SHIFT
#define TIM_32B_CCER_CC4P_MASK                     TIM2_CCER_CC4P_MASK
#define TIM_32B_CCER_CC4P(x)                       TIM2_CCER_CC4P(x)

#define TIM_32B_CCER_CC4E_SHIFT                    TIM2_CCER_CC4E_SHIFT
#define TIM_32B_CCER_CC4E_MASK                     TIM2_CCER_CC4E_MASK
#define TIM_32B_CCER_CC4E(x)                       TIM2_CCER_CC4E(x)

#define TIM_32B_CCER_CC3NP_SHIFT                   TIM2_CCER_CC3NP_SHIFT
#define TIM_32B_CCER_CC3NP_MASK                    TIM2_CCER_CC3NP_MASK
#define TIM_32B_CCER_CC3NP(x)                      TIM2_CCER_CC3NP(x)

#define TIM_32B_CCER_CC3P_SHIFT                    TIM2_CCER_CC3P_SHIFT
#define TIM_32B_CCER_CC3P_MASK                     TIM2_CCER_CC3P_MASK
#define TIM_32B_CCER_CC3P(x)                       TIM2_CCER_CC3P(x)

#define TIM_32B_CCER_CC3E_SHIFT                    TIM2_CCER_CC3E_SHIFT
#define TIM_32B_CCER_CC3E_MASK                     TIM2_CCER_CC3E_MASK
#define TIM_32B_CCER_CC3E(x)                       TIM2_CCER_CC3E(x)

#define TIM_32B_CCER_CC2NP_SHIFT                   TIM2_CCER_CC2NP_SHIFT
#define TIM_32B_CCER_CC2NP_MASK                    TIM2_CCER_CC2NP_MASK
#define TIM_32B_CCER_CC2NP(x)                      TIM2_CCER_CC2NP(x)

#define TIM_32B_CCER_CC2P_SHIFT                    TIM2_CCER_CC2P_SHIFT
#define TIM_32B_CCER_CC2P_MASK                     TIM2_CCER_CC2P_MASK
#define TIM_32B_CCER_CC2P(x)                       TIM2_CCER_CC2P(x)

#define TIM_32B_CCER_CC2E_SHIFT                    TIM2_CCER_CC2E_SHIFT
#define TIM_32B_CCER_CC2E_MASK                     TIM2_CCER_CC2E_MASK
#define TIM_32B_CCER_CC2E(x)                       TIM2_CCER_CC2E(x)

#define TIM_32B_CCER_CC1NP_SHIFT                   TIM2_CCER_CC1NP_SHIFT
#define TIM_32B_CCER_CC1NP_MASK                    TIM2_CCER_CC1NP_MASK
#define TIM_32B_CCER_CC1NP(x)                      TIM2_CCER_CC1NP(x)

#define TIM_32B_CCER_CC1P_SHIFT                    TIM2_CCER_CC1P_SHIFT
#define TIM_32B_CCER_CC1P_MASK                     TIM2_CCER_CC1P_MASK
#define TIM_32B_CCER_CC1P(x)                       TIM2_CCER_CC1P(x)

#define TIM_32B_CCER_CC1E_SHIFT                    TIM2_CCER_CC1E_SHIFT
#define TIM_32B_CCER_CC1E_MASK                     TIM2_CCER_CC1E_MASK
#define TIM_32B_CCER_CC1E(x)                       TIM2_CCER_CC1E(x)

/*!
 * @brief TIM_32B_CNT Register Bit Definition
 */

#define TIM_32B_CNT_CNT_SHIFT                      TIM2_CNT_CNT_SHIFT
#define TIM_32B_CNT_CNT_MASK                       TIM2_CNT_CNT_MASK
#define TIM_32B_CNT_CNT(x)                         TIM2_CNT_CNT(x)

/*!
 * @brief TIM_32B_PSC Register Bit Definition
 */

#define TIM_32B_PSC_PSC_SHIFT                      TIM2_PSC_PSC_SHIFT
#define TIM_32B_PSC_PSC_MASK                       TIM2_PSC_PSC_MASK
#define TIM_32B_PSC_PSC(x)                         TIM2_PSC_PSC(x)

/*!
 * @brief TIM_32B_ARR Register Bit Definition
 */

