LengmoAngel/Rimuru/2.Firmware/Libraries/mm/Core/Inc/mm32f3273g_features.h
#define TIM_CCMR3_OC5PE_SHIFT                  (3)
#define TIM_CCMR3_OC5PE_MASK                   (0x01U << TIM_CCMR3_OC5PE_SHIFT)
#define TIM_CCMR3_OC5PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR3_OC5PE_SHIFT)) & TIM_CCMR3_OC5PE_MASK)

#define TIM_CCMR3_OC5FE_SHIFT                  (2)
#define TIM_CCMR3_OC5FE_MASK                   (0x01U << TIM_CCMR3_OC5FE_SHIFT)
#define TIM_CCMR3_OC5FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR3_OC5FE_SHIFT)) & TIM_CCMR3_OC5FE_MASK)

/*!
 * @brief TIM_CCR5 Register Bit Definition
 */

#define TIM_CCR5_CCR5_SHIFT                    (0)
#define TIM_CCR5_CCR5_MASK                     (0xFFFFU << TIM_CCR5_CCR5_SHIFT)
#define TIM_CCR5_CCR5(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCR5_CCR5_SHIFT)) & TIM_CCR5_CCR5_MASK)

/*!
 * @brief TIM_PDER Register Bit Definition
 */

#define TIM_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM_PDER_CCR5SHIFTEN_MASK              (0x01U << TIM_PDER_CCR5SHIFTEN_SHIFT)
#define TIM_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR5SHIFTEN_SHIFT)) & TIM_PDER_CCR5SHIFTEN_MASK)

#define TIM_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM_PDER_CCR4SHIFTEN_MASK              (0x01U << TIM_PDER_CCR4SHIFTEN_SHIFT)
#define TIM_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR4SHIFTEN_SHIFT)) & TIM_PDER_CCR4SHIFTEN_MASK)

#define TIM_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM_PDER_CCR3SHIFTEN_MASK              (0x01U << TIM_PDER_CCR3SHIFTEN_SHIFT)
#define TIM_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR3SHIFTEN_SHIFT)) & TIM_PDER_CCR3SHIFTEN_MASK)

#define TIM_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM_PDER_CCR2SHIFTEN_MASK              (0x01U << TIM_PDER_CCR2SHIFTEN_SHIFT)
#define TIM_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR2SHIFTEN_SHIFT)) & TIM_PDER_CCR2SHIFTEN_MASK)

#define TIM_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM_PDER_CCR1SHIFTEN_MASK              (0x01U << TIM_PDER_CCR1SHIFTEN_SHIFT)
#define TIM_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR1SHIFTEN_SHIFT)) & TIM_PDER_CCR1SHIFTEN_MASK)

#define TIM_PDER_CCDREPE_SHIFT                 (0)
#define TIM_PDER_CCDREPE_MASK                  (0x01U << TIM_PDER_CCDREPE_SHIFT)
#define TIM_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCDREPE_SHIFT)) & TIM_PDER_CCDREPE_MASK)

/*!
 * @brief TIM_CCRFALL Register Bit Definition
 */

#define TIM_CCRFALL_CCRXFALL_SHIFT             (0)
#define TIM_CCRFALL_CCRXFALL_MASK              (0xFFFFU << TIM_CCRFALL_CCRXFALL_SHIFT)
#define TIM_CCRFALL_CCRXFALL(x)                (((uint32_t)(((uint32_t)(x)) << TIM_CCRFALL_CCRXFALL_SHIFT)) & TIM_CCRFALL_CCRXFALL_MASK)

/*!
 * @}
 */ /* end of group TIM_Register_Masks */

/*!
 * @brief SPI_I2S_I2SCFGR Register Bit Definition
 */

#define SPI_I2S_I2SCFGR_HFDSEL_SHIFT             (13)
#define SPI_I2S_I2SCFGR_HFDSEL_MASK              (0X0U << SPI_I2S_I2SCFGR_HFDSEL_SHIFT)
#define SPI_I2S_I2SCFGR_HFDSEL(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_HFDSEL_SHIFT)) & SPI_I2S_I2SCFGR_HFDSEL_MASK)

#define SPI_I2S_I2SCFGR_MCKSEL_SHIFT             (12)
#define SPI_I2S_I2SCFGR_MCKSEL_MASK              (0X0U << SPI_I2S_I2SCFGR_MCKSEL_SHIFT)
#define SPI_I2S_I2SCFGR_MCKSEL(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_MCKSEL_SHIFT)) & SPI_I2S_I2SCFGR_MCKSEL_MASK)

 #endif /* __MM32F3273G_FEATURES_H__ */
